# Taps
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/homebrew-cask"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

# Brew installs
brew "coreutils"
brew "python"
brew "zsh zsh-completions"
brew "git"
brew "htop"
brew "flake8"
brew "neovim"
brew "docker"
brew "go"
brew "fzf"
brew "yabai", args: ['HEAD']
brew "koekeishiya/formulae/skhd"

# Cask installs
cask "alacritty"
cask "google-chrome"
cask "spotify"
cask "ticktick"
cask "alfred"
cask "adobe-acrobat-reader"

# Cask tap installs
cask "font-fira-code"
